In [1]:
import pandas as pd
bd_weather = pd.DataFrame({
    'city' : ['dhaka', 'sylhet', 'rajshahi'],
    'temperatur' : [32, 33, 45],
    'humidity' : [80, 60, 55]
})
bd_weather

       city  temperatur  humidity
0     dhaka          32        80
1    sylhet          33        60
2  rajshahi          45        55

In [2]:
us_weather = pd.DataFrame({
    'city' : ['new york', 'chicago', 'orlando'],
    'temperatur' : [21, 14, 35],
    'humidity' : [67, 65, 73]
})
us_weather

       city  temperatur  humidity
0  new york          21        67
1   chicago          14        65
2   orlando          35        73

In [3]:
df = pd.concat([bd_weather, us_weather])
df

       city  temperatur  humidity
0     dhaka          32        80
1    sylhet          33        60
2  rajshahi          45        55
0  new york          21        67
1   chicago          14        65
2   orlando          35        73

In [4]:
df = pd.concat([bd_weather, us_weather], ignore_index=True)
df

       city  temperatur  humidity
0     dhaka          32        80
1    sylhet          33        60
2  rajshahi          45        55
3  new york          21        67
4   chicago          14        65
5   orlando          35        73

In [5]:
df = pd.concat([bd_weather, us_weather], keys=["Bangladesh", "USA"])
df

                  city  temperatur  humidity
Bangladesh 0     dhaka          32        80
           1    sylhet          33        60
           2  rajshahi          45        55
USA        0  new york          21        67
           1   chicago          14        65
           2   orlando          35        73

In [8]:
df.loc["Bangladesh"]

       city  temperatur  humidity
0     dhaka          32        80
1    sylhet          33        60
2  rajshahi          45        55

In [10]:
temperature_df = pd.DataFrame({
    'city' : ['dhaka', 'sylhet', 'rajshahi'],
    'temperatur' : [32, 33, 45],
})
temperature_df

       city  temperatur
0     dhaka          32
1    sylhet          33
2  rajshahi          45

In [11]:
windspeed_df = pd.DataFrame({
    'city' : ['dhaka', 'sylhet', 'rajshahi'],
    'windspeed' : [7, 12, 8]
})
windspeed_df

       city  windspeed
0     dhaka          7
1    sylhet         12
2  rajshahi          8

In [15]:
df = pd.concat([temperature_df, windspeed_df], axis=1)
df

       city  temperatur      city  windspeed
0     dhaka          32     dhaka          7
1    sylhet          33    sylhet         12
2  rajshahi          45  rajshahi          8

In [16]:
temperature_df

       city  temperatur
0     dhaka          32
1    sylhet          33
2  rajshahi          45

In [17]:
s = pd.Series(['Dry', 'Rain', 'Humid'], name="event")
s

0      Dry
1     Rain
2    Humid
Name: event, dtype: object

In [18]:
df = pd.concat([temperature_df, s], axis=1)
df

       city  temperatur  event
0     dhaka          32    Dry
1    sylhet          33   Rain
2  rajshahi          45  Humid